# RebarContainerItem Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarContainerItem Properties
RebarContainerItem Class See Also
---
The RebarContainerItem type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArrayLength | Identifies the distribution path length of rebar set. |
| BarsOnNormalSide | Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal. |
| BarTypeId | The identifier of the rebar bar type. |
| BaseFinishingTurns | For a spiral, the number of finishing turns at the lower end of the spiral. |
| Height | For a spiral, the overall height. |
| IncludeFirstBar | Identifies if the first bar in rebar set is shown. |
| IncludeLastBar | Identifies if the last bar in rebar set is shown. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ItemIndex | The index of this item in its associated RebarContainer. |
| LayoutRule | Identifies the layout rule of rebar set. |
| MaxSpacing | Identifies the maximum spacing between rebar in rebar set. |
| MultiplanarDepth | For a multiplanar rebar, the depth of the instance. |
| Normal | A unit-length vector normal to the plane of the rebar |
| NumberOfBarPositions | The number of potential bars in the set. |
| Pitch | For a spiral, the pitch, or vertical distance traveled in one rotation. |
| Quantity | Identifies the number of bars in rebar set. |
| RebarShapeId | The RebarShape element that defines the shape of the rebar. |
| TopFinishingTurns | For a spiral, the number of finishing turns at the upper end of the spiral. |
| TotalLength | The length of an individual bar multiplied by Quantity. |
| Volume | The volume of an individual bar multiplied by Quantity. |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace